app/controllers/homes_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @home = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    # byebug
    @product = Product.find(params[:id])

INSERT INTO "products" ("name", "description", "created_at", "updated_at", "check_box", "email") VALUES (?, ?, ?, ?, ?, ?)  [["name", "qq"], ["description", "ss"], ["created_at", "2022-08-30 06:05:33.162198"], ["updated_at", "2022-08-30 06:05:33.162198"], ["check_box", 1], ["email", "dsd"]]
---
  def create
# byebug
    @product = Product.new(home_params)

    if @product.save