app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
 def show
    # byebug
    @user = User.find(params[:id])

INSERT INTO "users" ("login", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "dzcsdddcxcv"], ["email", "dfvdf"], ["created_at", "2022-08-31 07:02:04.138372"], ["updated_at", "2022-08-31 07:02:04.138372"]]
---
  def create
    @user = User.new(user_params)

    if @user.save